console.log("Hello from JS Operations");

const number = 1;
const stringNumber = "1";
console.log(number === stringNumber);
console.log(number == stringNumber);

// Operators' exercise
// 8. Гурвалжингийн периметрийг олох
// 9. Тойргийн талбайг олох
// 10. m = y2-y1/x2-x1 хариуг олох
// 11. 15 МB дата 3 секундэд манай интернэт онлайнаар татаж чаддаг бол түүнийг BIT Rate-ийг олно уу.
// 12. side1, side2, side3 гэсэн хувьсагчдад гурвалжны гурван талыг онооно. Ийнхүү гурван тал өгөдсөн байхад үед гурвалжны талбайг ол.
// 13. Өгсөн тоог цельсээс фаренгейт рүү хөрвүүл.
// 14. Хоёр багийн дундаж оноог олно уу. ( A team - 96, 108, 89; B team - 88, 91, 110 )
// 15. 2 хувьсагч зарлан 2 тоон утга өг. Тухайн 2 хувьсагчдаар Math-ийн 5н үйлдэлүүдийг (+-*/%) гүцэтгээд үр дүнг нь дараах байдлаар харуул:
// Өгөгдсөн 2 тооны нийлбэр нь 25
// Өгөгдсөн 2 тооны ялгавар нь 5
// 16. cm -г inch рүү хөрвүүлэх. inch -г cm рүү хөрвүүлэх
// 17. Гараас дугуйн радиус буюу r орж ирэхэд тухайн дугуйн эзэлхүүнийг ол. Гараас дугуйн радиус буюу r, орж ирэхэд тухайн дугуйн хүрээний уртыг ол.
// 18. 3 оронтоо тооны хамгийн эхний цифрийг олох илэрхийлэл бич

const numberA = 5;
const numberB = 5;
const numberC = 6;

console.log("parameter", numberA + numberB + numberC);

const radiusA = 3
const P = 3.14

console.log(P*radiusA*radiusA)
